leotyes/jamhacks10/backend/uploads/4911c045-5aed-4cd0-9dd2-ce3e68ce4edd/mics-setup.ioc
#MicroXplorer Configuration settings - do not modify
BSP_IP_NAME=NUCLEO-H7A3ZI-Q
Bdma1.DFSDM1_FLT4_ON_BDMA1.0.Direction=DMA_PERIPH_TO_MEMORY
Bdma1.DFSDM1_FLT4_ON_BDMA1.0.Instance=BDMA1_Channel4
Bdma1.DFSDM1_FLT4_ON_BDMA1.0.MemDataAlignment=DMA_MDATAALIGN_WORD
Bdma1.DFSDM1_FLT4_ON_BDMA1.0.MemInc=DMA_MINC_ENABLE
Bdma1.DFSDM1_FLT4_ON_BDMA1.0.Mode=DMA_CIRCULAR
Bdma1.DFSDM1_FLT4_ON_BDMA1.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Bdma1.DFSDM1_FLT4_ON_BDMA1.0.PeriphInc=DMA_PINC_DISABLE
Bdma1.DFSDM1_FLT4_ON_BDMA1.0.Priority=DMA_PRIORITY_MEDIUM
Bdma1.DFSDM1_FLT4_ON_BDMA1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
Bdma1.DFSDM1_FLT5_ON_BDMA1.1.Direction=DMA_PERIPH_TO_MEMORY
Bdma1.DFSDM1_FLT5_ON_BDMA1.1.Instance=BDMA1_Channel5
Bdma1.DFSDM1_FLT5_ON_BDMA1.1.MemDataAlignment=DMA_MDATAALIGN_WORD
Bdma1.DFSDM1_FLT5_ON_BDMA1.1.MemInc=DMA_MINC_ENABLE
Bdma1.DFSDM1_FLT5_ON_BDMA1.1.Mode=DMA_CIRCULAR
Bdma1.DFSDM1_FLT5_ON_BDMA1.1.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Bdma1.DFSDM1_FLT5_ON_BDMA1.1.PeriphInc=DMA_PINC_DISABLE
Bdma1.DFSDM1_FLT5_ON_BDMA1.1.Priority=DMA_PRIORITY_MEDIUM
Bdma1.DFSDM1_FLT5_ON_BDMA1.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
Bdma1.Request0=DFSDM1_FLT4_ON_BDMA1
Bdma1.Request1=DFSDM1_FLT5_ON_BDMA1
Bdma1.RequestsNb=2
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M7.Enable_S-Cortex_Memory_Protection_Unit_Region13_Settings_S=__NULL
CORTEX_M7.Enable_S-Cortex_Memory_Protection_Unit_Region1_Settings_S=__NULL
CORTEX_M7.IPParameters=default_mode_Activation,Enable_S-Cortex_Memory_Protection_Unit_Region1_Settings_S,MPU_Control,Enable_S-Cortex_Memory_Protection_Unit_Region13_Settings_S
CORTEX_M7.MPU_Control=MPU_PRIVILEGED_DEFAULT
CORTEX_M7.default_mode_Activation=1
DFSDM1.Divider=22
DFSDM1.DmaMode_reg_FIL0=ENABLE
DFSDM1.DmaMode_reg_FIL1=ENABLE
DFSDM1.DmaMode_reg_FIL2=ENABLE
DFSDM1.DmaMode_reg_FIL3=ENABLE
DFSDM1.DmaMode_reg_FIL4=ENABLE
DFSDM1.DmaMode_reg_FIL5=ENABLE
DFSDM1.FastMode_reg_FIL2=DISABLE
DFSDM1.FilterOrder_CH0=DFSDM_CHANNEL_SINC3_ORDER
DFSDM1.FilterOrder_CH1=DFSDM_CHANNEL_SINC3_ORDER
DFSDM1.FilterOrder_CH2=DFSDM_CHANNEL_SINC3_ORDER
DFSDM1.FilterOrder_CH3=DFSDM_CHANNEL_SINC3_ORDER
DFSDM1.FilterOrder_CH4=DFSDM_CHANNEL_SINC3_ORDER
DFSDM1.FilterOrder_CH5=DFSDM_CHANNEL_SINC3_ORDER
DFSDM1.Filter_regChannel_FIL0=DFSDM_CHANNEL_0
DFSDM1.Filter_regChannel_FIL1=DFSDM_CHANNEL_1
DFSDM1.Filter_regChannel_FIL2=DFSDM_CHANNEL_2
DFSDM1.Filter_regChannel_FIL3=DFSDM_CHANNEL_3
DFSDM1.Filter_regChannel_FIL4=DFSDM_CHANNEL_4
DFSDM1.Filter_regChannel_FIL5=DFSDM_CHANNEL_5
DFSDM1.Fosr_FIL0=24
DFSDM1.Fosr_FIL1=24
DFSDM1.Fosr_FIL2=24
DFSDM1.Fosr_FIL3=24
DFSDM1.Fosr_FIL4=24
DFSDM1.Fosr_FIL5=24
DFSDM1.IPParameters=Filter_regChannel_FIL0,SincOrder_FIL0,Fosr_FIL0,Filter_regChannel_FIL1,SincOrder_FIL1,Fosr_FIL1,Filter_regChannel_FIL2,Fosr_FIL2,SincOrder_FIL2,Filter_regChannel_FIL3,SincOrder_FIL3,Filter_regChannel_FIL4,Fosr_FIL4,SincOrder_FIL4,Filter_regChannel_FIL5,SincOrder_FIL5,Fosr_FIL5,Divider,Fosr_FIL3,Type_spi_CH0,Type_spi_CH1,Type_spi_CH2,Type_spi_CH3,Type_spi_CH4,Type_spi_CH5,Trigger_reg_FIL1,Trigger_reg_FIL2,Trigger_reg_FIL3,Trigger_reg_FIL4,Trigger_reg_FIL5,DmaMode_reg_FIL0,DmaMode_reg_FIL1,DmaMode_reg_FIL2,DmaMode_reg_FIL3,DmaMode_reg_FIL4,DmaMode_reg_FIL5,FilterOrder_CH2,FilterOrder_CH1,FilterOrder_CH3,FilterOrder_CH4,FilterOrder_CH0,Iosr_FIL0,FilterOrder_CH5,Iosr_FIL1,Iosr_FIL2,Iosr_FIL3,Iosr_FIL4,Iosr_FIL5,RightBitShift_CH0,RightBitShift_CH1,RightBitShift_CH2,FastMode_reg_FIL2,RightBitShift_CH3,RightBitShift_CH4
DFSDM1.Iosr_FIL0=8
DFSDM1.Iosr_FIL1=8
DFSDM1.Iosr_FIL2=8
DFSDM1.Iosr_FIL3=8
DFSDM1.Iosr_FIL4=8
DFSDM1.Iosr_FIL5=8
DFSDM1.RightBitShift_CH0=0x03
DFSDM1.RightBitShift_CH1=0x03
DFSDM1.RightBitShift_CH2=0x03
DFSDM1.RightBitShift_CH3=0x03
DFSDM1.RightBitShift_CH4=0x03
DFSDM1.SincOrder_FIL0=DFSDM_FILTER_SINC3_ORDER
DFSDM1.SincOrder_FIL1=DFSDM_FILTER_SINC3_ORDER
DFSDM1.SincOrder_FIL2=DFSDM_FILTER_SINC3_ORDER
DFSDM1.SincOrder_FIL3=DFSDM_FILTER_SINC3_ORDER
DFSDM1.SincOrder_FIL4=DFSDM_FILTER_SINC3_ORDER
DFSDM1.SincOrder_FIL5=DFSDM_FILTER_SINC3_ORDER
DFSDM1.Trigger_reg_FIL1=DFSDM_FILTER_SW_TRIGGER
DFSDM1.Trigger_reg_FIL2=DFSDM_FILTER_SW_TRIGGER
DFSDM1.Trigger_reg_FIL3=DFSDM_FILTER_SW_TRIGGER
DFSDM1.Trigger_reg_FIL4=DFSDM_FILTER_SW_TRIGGER
DFSDM1.Trigger_reg_FIL5=DFSDM_FILTER_SW_TRIGGER
DFSDM1.Type_spi_CH0=DFSDM_CHANNEL_SPI_RISING
DFSDM1.Type_spi_CH1=DFSDM_CHANNEL_SPI_RISING
DFSDM1.Type_spi_CH2=DFSDM_CHANNEL_SPI_RISING
DFSDM1.Type_spi_CH3=DFSDM_CHANNEL_SPI_RISING
DFSDM1.Type_spi_CH4=DFSDM_CHANNEL_SPI_RISING
DFSDM1.Type_spi_CH5=DFSDM_CHANNEL_SPI_RISING
Dma.DFSDM1_FLT0.0.Direction=DMA_PERIPH_TO_MEMORY
Dma.DFSDM1_FLT0.0.EventEnable=DISABLE
Dma.DFSDM1_FLT0.0.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.DFSDM1_FLT0.0.Instance=DMA2_Stream0
Dma.DFSDM1_FLT0.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.DFSDM1_FLT0.0.MemInc=DMA_MINC_ENABLE
Dma.DFSDM1_FLT0.0.Mode=DMA_CIRCULAR
Dma.DFSDM1_FLT0.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.DFSDM1_FLT0.0.PeriphInc=DMA_PINC_DISABLE
Dma.DFSDM1_FLT0.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.DFSDM1_FLT0.0.Priority=DMA_PRIORITY_MEDIUM
Dma.DFSDM1_FLT0.0.RequestNumber=1
Dma.DFSDM1_FLT0.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.DFSDM1_FLT0.0.SignalID=NONE
Dma.DFSDM1_FLT0.0.SyncEnable=DISABLE
Dma.DFSDM1_FLT0.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.DFSDM1_FLT0.0.SyncRequestNumber=1
Dma.DFSDM1_FLT0.0.SyncSignalID=NONE
Dma.DFSDM1_FLT1.1.Direction=DMA_PERIPH_TO_MEMORY
Dma.DFSDM1_FLT1.1.EventEnable=DISABLE
Dma.DFSDM1_FLT1.1.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.DFSDM1_FLT1.1.Instance=DMA2_Stream1
Dma.DFSDM1_FLT1.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.DFSDM1_FLT1.1.MemInc=DMA_MINC_ENABLE
Dma.DFSDM1_FLT1.1.Mode=DMA_CIRCULAR
Dma.DFSDM1_FLT1.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.DFSDM1_FLT1.1.PeriphInc=DMA_PINC_DISABLE
Dma.DFSDM1_FLT1.1.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.DFSDM1_FLT1.1.Priority=DMA_PRIORITY_MEDIUM
Dma.DFSDM1_FLT1.1.RequestNumber=1
Dma.DFSDM1_FLT1.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.DFSDM1_FLT1.1.SignalID=NONE
Dma.DFSDM1_FLT1.1.SyncEnable=DISABLE
Dma.DFSDM1_FLT1.1.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.DFSDM1_FLT1.1.SyncRequestNumber=1
Dma.DFSDM1_FLT1.1.SyncSignalID=NONE
Dma.DFSDM1_FLT2.3.Direction=DMA_PERIPH_TO_MEMORY
Dma.DFSDM1_FLT2.3.EventEnable=DISABLE
Dma.DFSDM1_FLT2.3.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.DFSDM1_FLT2.3.Instance=DMA2_Stream2
Dma.DFSDM1_FLT2.3.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.DFSDM1_FLT2.3.MemInc=DMA_MINC_ENABLE
Dma.DFSDM1_FLT2.3.Mode=DMA_CIRCULAR
Dma.DFSDM1_FLT2.3.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.DFSDM1_FLT2.3.PeriphInc=DMA_PINC_DISABLE
Dma.DFSDM1_FLT2.3.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.DFSDM1_FLT2.3.Priority=DMA_PRIORITY_MEDIUM
Dma.DFSDM1_FLT2.3.RequestNumber=1
Dma.DFSDM1_FLT2.3.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.DFSDM1_FLT2.3.SignalID=NONE
Dma.DFSDM1_FLT2.3.SyncEnable=DISABLE
Dma.DFSDM1_FLT2.3.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.DFSDM1_FLT2.3.SyncRequestNumber=1
Dma.DFSDM1_FLT2.3.SyncSignalID=NONE
Dma.DFSDM1_FLT3.2.Direction=DMA_PERIPH_TO_MEMORY
Dma.DFSDM1_FLT3.2.EventEnable=DISABLE
Dma.DFSDM1_FLT3.2.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.DFSDM1_FLT3.2.Instance=DMA2_Stream3
Dma.DFSDM1_FLT3.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.DFSDM1_FLT3.2.MemInc=DMA_MINC_ENABLE
Dma.DFSDM1_FLT3.2.Mode=DMA_CIRCULAR
Dma.DFSDM1_FLT3.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.DFSDM1_FLT3.2.PeriphInc=DMA_PINC_DISABLE
Dma.DFSDM1_FLT3.2.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.DFSDM1_FLT3.2.Priority=DMA_PRIORITY_MEDIUM
Dma.DFSDM1_FLT3.2.RequestNumber=1
Dma.DFSDM1_FLT3.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.DFSDM1_FLT3.2.SignalID=NONE
Dma.DFSDM1_FLT3.2.SyncEnable=DISABLE
Dma.DFSDM1_FLT3.2.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.DFSDM1_FLT3.2.SyncRequestNumber=1
Dma.DFSDM1_FLT3.2.SyncSignalID=NONE
Dma.Request0=DFSDM1_FLT0
Dma.Request1=DFSDM1_FLT1
Dma.Request2=DFSDM1_FLT3
Dma.Request3=DFSDM1_FLT2
Dma.Request4=USART3_TX
Dma.RequestsNb=5
Dma.USART3_TX.4.Direction=DMA_MEMORY_TO_PERIPH
Dma.USART3_TX.4.EventEnable=DISABLE
Dma.USART3_TX.4.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.USART3_TX.4.Instance=DMA1_Stream0
Dma.USART3_TX.4.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART3_TX.4.MemInc=DMA_MINC_ENABLE
Dma.USART3_TX.4.Mode=DMA_NORMAL
Dma.USART3_TX.4.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.USART3_TX.4.PeriphInc=DMA_PINC_DISABLE
Dma.USART3_TX.4.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.USART3_TX.4.Priority=DMA_PRIORITY_MEDIUM
Dma.USART3_TX.4.RequestNumber=1
Dma.USART3_TX.4.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.USART3_TX.4.SignalID=NONE
Dma.USART3_TX.4.SyncEnable=DISABLE
Dma.USART3_TX.4.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.USART3_TX.4.SyncRequestNumber=1
Dma.USART3_TX.4.SyncSignalID=NONE
File.Version=6
GPIO.groupedBy=Group By Peripherals
KeepUserPlacement=false
MMTAppRegionsCount=0
MMTConfigApplied=false
MMTSectionSuffix=
Mcu.CPN=STM32H7A3ZIT6Q
Mcu.Family=STM32H7
Mcu.IP0=BDMA1
Mcu.IP1=CORTEX_M7
Mcu.IP10=NUCLEO-H7A3ZI-Q
Mcu.IP2=DFSDM1
Mcu.IP3=DMA
Mcu.IP4=MEMORYMAP
Mcu.IP5=NVIC
Mcu.IP6=RCC
Mcu.IP7=SPI1
Mcu.IP8=SYS
Mcu.IP9=USART3
Mcu.IPNb=11
Mcu.Name=STM32H7A3Z(G-I)TxQ
Mcu.Package=LQFP144
Mcu.Pin0=PC14-OSC32_IN
Mcu.Pin1=PC15-OSC32_OUT
Mcu.Pin10=PA6
Mcu.Pin11=PA7
Mcu.Pin12=PC5
Mcu.Pin13=PE12
Mcu.Pin14=PD8
Mcu.Pin15=PD9
Mcu.Pin16=PC7
Mcu.Pin17=VP_SYS_VS_Systick
Mcu.Pin18=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin19=VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_DSPOoLibraryJjLibrary_1.4.0_1.4.0
Mcu.Pin2=PH0-OSC_IN
Mcu.Pin3=PH1-OSC_OUT
Mcu.Pin4=PC0
Mcu.Pin5=PC1
Mcu.Pin6=PC2_C
Mcu.Pin7=PC3_C
Mcu.Pin8=PA3
Mcu.Pin9=PA5
Mcu.PinsNb=20
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-ALGOBUILD.1.4.0
Mcu.ThirdPartyNb=1
Mcu.UserConstants=
Mcu.UserName=STM32H7A3ZITxQ
MxCube.Version=6.16.1
MxDb.Version=DB.6.0.161
NVIC.BDMA1_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DFSDM1_FLT0_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.DFSDM1_FLT1_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.DFSDM1_FLT2_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.DFSDM1_FLT3_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.DFSDM1_FLT4_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.DFSDM1_FLT5_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.DMA1_Stream0_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA2_Stream0_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA2_Stream1_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA2_Stream2_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA2_Stream3_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false
NVIC.USART3_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA3.GPIOParameters=PinState,GPIO_Label
PA3.GPIO_Label=SR_LATCH
PA3.Locked=true
PA3.PinState=GPIO_PIN_SET
PA3.Signal=GPIO_Output
PA5.Mode=Full_Duplex_Master
PA5.Signal=SPI1_SCK
PA6.Mode=Full_Duplex_Master
PA6.Signal=SPI1_MISO
PA7.Mode=Full_Duplex_Master
PA7.Signal=SPI1_MOSI
PC0.Signal=S_DATAIN4DFSDM1
PC1.Signal=S_DATAIN0DFSDM1
PC14-OSC32_IN.GPIOParameters=GPIO_Label
PC14-OSC32_IN.GPIO_Label=OSC32_IN
PC14-OSC32_IN.Locked=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
PC15-OSC32_OUT.GPIOParameters=GPIO_Label
PC15-OSC32_OUT.GPIO_Label=OSC32_OUT
PC15-OSC32_OUT.Locked=true
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PC2_C.Signal=S_CKOUTDFSDM1
PC3_C.Signal=S_DATAIN1DFSDM1
PC5.Signal=S_DATAIN2DFSDM1
PC7.Signal=S_DATAIN3DFSDM1
PCC.Checker=false
PCC.Line=STM32H7A3/7B3
PCC.MCU=STM32H7A3Z(G-I)TxQ
PCC.PartNumber=STM32H7A3ZITxQ
PCC.Series=STM32H7
PCC.Temperature=25
PCC.Vdd=3.0
PD8.Locked=true
PD8.Mode=Asynchronous
PD8.Signal=USART3_TX
PD9.Locked=true
PD9.Mode=Asynchronous
PD9.Signal=USART3_RX
PE12.Signal=S_DATAIN5DFSDM1
PH0-OSC_IN.GPIOParameters=GPIO_Label
PH0-OSC_IN.GPIO_Label=PH0-MCU
PH0-OSC_IN.Locked=true
PH0-OSC_IN.Signal=RCC_OSC_IN
PH1-OSC_OUT.GPIOParameters=GPIO_Label
PH1-OSC_OUT.GPIO_Label=PH1-MCU
PH1-OSC_OUT.Locked=true
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerLinker=GCC
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32H7A3ZITxQ
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.12.1
ProjectManager.FreePins=false
ProjectManager.FreePinsContext=
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=STM32CubeIDE
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=mics-setup.ioc
ProjectManager.ProjectName=mics-setup
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-MX_BDMA1_Init-BDMA1-false-HAL-true,4-SystemClock_Config-RCC-false-HAL-false,5-MX_DFSDM1_Init-DFSDM1-false-HAL-true,6-MX_USART3_UART_Init-USART3-false-HAL-true,7-MX_SPI1_Init-SPI1-false-HAL-true,8-MX_SAI1_Init-SAI1-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
RCC.ADCFreq_Value=129000000
RCC.AHB12Freq_Value=64000000
RCC.AHB4Freq_Value=64000000
RCC.APB1Freq_Value=64000000
RCC.APB2Freq_Value=64000000
RCC.APB3Freq_Value=64000000
RCC.APB4Freq_Value=64000000
RCC.AXIClockFreq_Value=64000000
RCC.CDCPREFreq_Value=64000000
RCC.CECFreq_Value=32000
RCC.CKPERFreq_Value=64000000
RCC.CortexFreq_Value=64000000
RCC.CpuClockFreq_Value=64000000
RCC.DAC1Freq_Value=32000
RCC.DAC2Freq_Value=32000
RCC.DFSDM2ACLkFreq_Value=64000000
RCC.DFSDM2Freq_Value=64000000
RCC.DFSDMACLkFreq_Value=32000000
RCC.DFSDMFreq_Value=64000000
RCC.DIVM1=4
RCC.DIVM3=1
RCC.DIVN1=8
RCC.DIVN3=24
RCC.DIVP1Freq_Value=64000000
RCC.DIVP2Freq_Value=129000000
RCC.DIVP3Freq_Value=768000000
RCC.DIVQ1=4
RCC.DIVQ1Freq_Value=32000000
RCC.DIVQ2Freq_Value=129000000
RCC.DIVQ3Freq_Value=768000000
RCC.DIVR1Freq_Value=64000000
RCC.DIVR2Freq_Value=129000000
RCC.DIVR3Freq_Value=768000000
RCC.FDCANFreq_Value=32000000
RCC.FMCFreq_Value=64000000
RCC.FamilyName=M
RCC.HCLK3ClockFreq_Value=64000000
RCC.HCLKFreq_Value=64000000
RCC.HSE_VALUE=8000000
RCC.I2C123Freq_Value=64000000
RCC.I2C4Freq_Value=64000000
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CDCPREFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,DAC1Freq_Value,DAC2Freq_Value,DFSDM2ACLkFreq_Value,DFSDM2Freq_Value,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM3,DIVN1,DIVN3,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLLFRACN,PWR_Regulator_Voltage_Scale,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI2AFreq_Value,SAI2BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,SupplySource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
RCC.LPTIM1Freq_Value=64000000
RCC.LPTIM2Freq_Value=64000000
RCC.LPTIM345Freq_Value=64000000
RCC.LPUART1Freq_Value=64000000
RCC.LTDCFreq_Value=768000000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=64000000
RCC.PLLFRACN=0
RCC.PWR_Regulator_Voltage_Scale=PWR_REGULATOR_VOLTAGE_SCALE0
RCC.QSPIFreq_Value=64000000
RCC.RNGFreq_Value=48000000
RCC.RTCFreq_Value=32000
RCC.SAI1Freq_Value=32000000
RCC.SAI2AFreq_Value=32000000
RCC.SAI2BFreq_Value=32000000
RCC.SDMMCFreq_Value=32000000
RCC.SPDIFRXFreq_Value=32000000
RCC.SPI123Freq_Value=32000000
RCC.SPI45Freq_Value=64000000
